# Práctica Python - Tecnolgías de Procesamiento Big Data

+ Autor: Felipe Navarro
+ Fecha: 29/11/2020

## Ejercicio 2

In [2]:
import pandas as pd
import os
import unidecode
import re

from functools import reduce

In [58]:
#conda activate tecnologias

Cargamos los datos

In [3]:
folder = "ine_activos"

In [4]:
headers = os.listdir(folder)
headers = [os.path.splitext(each)[0] for each in headers]

In [5]:
headers = [unidecode.unidecode(bytes(x,'UTF-8').decode('utf8',"strict")) for x in headers]

In [6]:
tablas_ine = map(lambda x: pd.read_csv(os.path.join(folder,x),header=0),os.listdir(folder))

In [7]:
ind = 0
for item in tablas_ine:
    if ind==0:
        df_ine = item
        df_ine=df_ine.rename(columns={"valor":headers[ind]})
        ind +=1
    else:
        df_ine = df_ine.merge(item, on="cod_provincia",how="left")
        df_ine=df_ine.rename(columns={"valor_x":headers[ind-1],"valor_y":headers[ind],"valor":headers[ind]})
        ind+=1

In [8]:
df_ine.head()

,cod_provincia,2008T1_Agricultura,2008T1_Construccion,2008T1_Industria,2008T1_ParadosActivos,2008T1_Servicios,2008T2_Agricultura,2008T2_Construccion,2008T2_Industria,2008T2_ParadosActivos,...,2017T1_Agricultura,2017T1_Construccion,2017T1_Industria,2017T1_ParadosActivos,2017T1_Servicios,2017T2_Agricultura,2017T2_Construccion,2017T2_Industria,2017T2_ParadosActivos,2017T2_Servicios
0,2,15.4,23.4,30.8,7.2,114.1,12.2,23.5,32.9,6.7,...,14.2,9.2,24.2,22.9,116.9,13.8,11.0,23.1,25.7,118.1
1,3,21.5,134.9,157.5,32.7,536.8,27.8,123.3,149.9,40.3,...,21.9,56.6,144.7,89.0,593.1,24.7,59.4,152.0,83.3,587.3
2,4,55.4,66.5,25.1,11.4,176.3,48.9,52.0,24.1,13.7,...,93.5,18.0,16.6,37.5,181.6,92.2,15.1,19.4,32.8,185.6
3,1,2.5,15.0,51.1,2.3,87.2,2.4,12.9,50.9,2.7,...,4.5,5.2,41.4,11.5,89.3,3.8,6.8,41.2,11.7,89.3
4,33,21.4,55.9,72.7,20.2,320.0,22.2,60.3,69.3,15.5,...,13.6,23.3,64.2,37.1,321.3,15.7,26.0,62.9,35.4,321.5

In [9]:
df_ine.shape

(52, 191)

In [10]:
df_provincias = pd.read_json("provincias.json")

In [11]:
df_provincias.head()

   cod_provincia      ds_provincia
0              2          Albacete
1              3  Alicante/Alacant
2              4           Almería
3              1       Araba/Álava
4             33          Asturias

Hacemos un join para unir los datos de los dos dataframes

In [12]:
df_ine = df_provincias.merge(df_ine,on="cod_provincia",how="inner")

In [13]:
df_ine.head()

,cod_provincia,ds_provincia,2008T1_Agricultura,2008T1_Construccion,2008T1_Industria,2008T1_ParadosActivos,2008T1_Servicios,2008T2_Agricultura,2008T2_Construccion,2008T2_Industria,...,2017T1_Agricultura,2017T1_Construccion,2017T1_Industria,2017T1_ParadosActivos,2017T1_Servicios,2017T2_Agricultura,2017T2_Construccion,2017T2_Industria,2017T2_ParadosActivos,2017T2_Servicios
0,2,Albacete,15.4,23.4,30.8,7.2,114.1,12.2,23.5,32.9,...,14.2,9.2,24.2,22.9,116.9,13.8,11.0,23.1,25.7,118.1
1,3,Alicante/Alacant,21.5,134.9,157.5,32.7,536.8,27.8,123.3,149.9,...,21.9,56.6,144.7,89.0,593.1,24.7,59.4,152.0,83.3,587.3
2,4,Almería,55.4,66.5,25.1,11.4,176.3,48.9,52.0,24.1,...,93.5,18.0,16.6,37.5,181.6,92.2,15.1,19.4,32.8,185.6
3,1,Araba/Álava,2.5,15.0,51.1,2.3,87.2,2.4,12.9,50.9,...,4.5,5.2,41.4,11.5,89.3,3.8,6.8,41.2,11.7,89.3
4,33,Asturias,21.4,55.9,72.7,20.2,320.0,22.2,60.3,69.3,...,13.6,23.3,64.2,37.1,321.3,15.7,26.0,62.9,35.4,321.5

Guardamos el dataframe en un csv, el encoding utf-8 es el que viene por defecto

In [14]:
df_ine.to_csv("salidas/ine_activos.csv")

Transformar el dataframe a un formato narrow

In [15]:
df_narrow = df_ine.melt(id_vars =["ds_provincia","cod_provincia"])

In [16]:
df_narrow.head()

       ds_provincia  cod_provincia            variable  value
0          Albacete              2  2008T1_Agricultura   15.4
1  Alicante/Alacant              3  2008T1_Agricultura   21.5
2           Almería              4  2008T1_Agricultura   55.4
3       Araba/Álava              1  2008T1_Agricultura    2.5
4          Asturias             33  2008T1_Agricultura   21.4

In [21]:
df_narrow["anio"] = df_narrow["variable"].apply(lambda x: pd.Series(re.search(r'\d{4}',str(x))[0]))

In [32]:
df_narrow["anio"] = df_narrow["anio"].astype("int64")

In [22]:
df_narrow["trimestre"] = df_narrow["variable"].apply(lambda x: pd.Series(re.search(r'(T\d)',"2008T1_Agricultura")[1][1]))

In [23]:
df_narrow["trimestre"] = df_narrow["variable"].apply(lambda x: pd.Series(re.search(r'(T\d)',str(x))[1][1]))

In [25]:
df_narrow["trimestre"] = df_narrow["trimestre"].astype("int64")

In [26]:
df_narrow[["basura","sector"]] = df_narrow.variable.str.split("_",expand=True,)

In [27]:
df_narrow = df_narrow.drop(columns=["basura","variable"])

In [31]:
df_narrow.head()

       ds_provincia  cod_provincia  value  anio  trimestre       sector
0          Albacete              2   15.4  2008          1  Agricultura
1  Alicante/Alacant              3   21.5  2008          1  Agricultura
2           Almería              4   55.4  2008          1  Agricultura
3       Araba/Álava              1    2.5  2008          1  Agricultura
4          Asturias             33   21.4  2008          1  Agricultura

In [33]:
df_narrow.dtypes

ds_provincia      object
cod_provincia      int64
value            float64
anio               int64
trimestre          int64
sector            object
dtype: object

In [34]:
df_narrow.to_csv("salidas/narrow_data.csv")

Cálculos con el dataframe narrow

In [35]:
activos_anio = df_narrow[df_narrow["trimestre"]==4]

In [36]:
activos_anio = activos_anio[["value","anio","sector"]].groupby(["anio","sector"]).sum()

In [37]:
activos_anio.head(10)

                       value
anio sector
2008 Agricultura       962.8
     Construccion     2764.0
     Industria        3370.1
     ParadosActivos   1036.6
     Servicios       15128.6
2009 Agricultura       972.1
     Construccion     2414.9
     Industria        3048.6
     ParadosActivos   1779.3
     Servicios       15010.7

Pivotar el df_narrow y guardar como excel

In [38]:
df_servicios = df_narrow[df_narrow["sector"]=="Servicios"]

In [39]:
df_servicios = df_servicios.pivot_table(values = ["value"],index=["ds_provincia"],columns=["anio","trimestre"])

In [40]:
df_servicios.head()

                  value                                                   \
anio               2008                        2009
trimestre             1      2      3      4      1      2      3      4
ds_provincia
Albacete          114.1  115.7  119.7  113.7  113.2  111.6  113.5  108.8
Alicante/Alacant  536.8  561.4  572.1  596.5  579.9  608.1  612.8  585.3
Almería           176.3  183.7  195.8  205.6  204.8  202.6  193.9  203.1
Araba/Álava        87.2   93.6  100.7  101.2  100.7   97.7   97.3   99.3
Asturias          320.0  332.0  330.7  330.7  337.9  336.2  332.6  326.0

                                ...                                            \
anio               2010         ...   2015                        2016
trimestre             1      2  ...      1      2      3      4      1      2
ds_provincia                    ...
Albacete          110.2  111.4  ...  114.2  114.9  117.2  117.9  110.2  109.2
Alicante/Alacant  577.9  563.7  ...  538.3  543.6  580.2  588.0  594.5  616.1
Almería           204.4  203.2  ...  196.4  196.4  186.2  182.4  181.3  177.9
Araba/Álava        98.7   97.8  ...   95.2   91.6   88.7   95.9   96.1   91.4
Asturias          328.5  322.6  ...  304.7  307.7  315.0  317.4  318.1  317.3


anio                             2017
trimestre             3      4      1      2
ds_provincia
Albacete          105.8  110.8  116.9  118.1
Alicante/Alacant  618.3  612.2  593.1  587.3
Almería           176.0  183.4  181.6  185.6
Araba/Álava        93.9   90.8   89.3   89.3
Asturias          320.4  316.0  321.3  321.5

[5 rows x 38 columns]

In [41]:
df_servicios.to_excel("salidas/servicios.xlsx")

Total de población activa en España para todos los sectores para cada año y trimestre

In [42]:
pob_activa = df_narrow[["anio","trimestre","sector","value"]].groupby(["anio","trimestre"]).sum()

In [43]:
pob_2009 = df_narrow[df_narrow["anio"] != 2008]

In [44]:
pob_2009 = pob_2009[["anio","trimestre","sector","value"]].groupby(["anio","trimestre"]).sum()

In [45]:
pob2 = df_narrow[df_narrow["anio"] != 2017]

In [46]:
pob2 = pob2[["anio","trimestre","sector","value"]].groupby(["anio","trimestre"]).sum()

In [47]:
pob_2009.reset_index(drop=True, inplace = True)
pob2.reset_index(drop=True, inplace = True)
pob2 = pob2.drop([34,35],0)

In [48]:
index = pob_activa.index
pob_activa.reset_index(drop=True, inplace = True)

In [49]:
pob_activa["value"] = (pob_2009["value"]-pob2["value"])/pob2["value"]

In [50]:
pob_activa = pob_activa.set_index(index)

In [51]:
pob_activa.head()

                   value
anio trimestre
2008 1          0.021618
     2          0.011319
     3          0.002734
     4         -0.001569
2009 1         -0.001425

In [52]:
pob_activa.to_json("salidas/tasas_poblacion_activa.json",orient="table")

Exportar el entorno con anaconda -- Lo he ejecutado en la consola directamente

In [53]:
#conda env export > env_tecnologias.yml

Note: you may need to restart the kernel to use updated packages.

In [57]:
#jupyter nbconvert --to python practica1_ejer2.ipynb.